# Part 1: Data Visualization with Python

## This script includes the following points:

### 1. Import Data

### 2. (step 4) Wrangle the data

### 3. (step 5) Data Quality and Consistency Checks

### 4. (step 6) Combine Customer Data with Rest of Data

### 5. (step 8) Export dataframe

In [1]:
#Import Libraries
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

### 1. Import Data

In [2]:
#Import Data
path = r'C:\Users\Marlo\OneDrive - South Washington County Schools\Home\job support\Coursework\Achievement 4\Instacart Basket Analysis'

In [3]:
customers = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [4]:
ords_prods_merge = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_agg.pkl'))

### 2. (step 4) Wrangle the Data

In [5]:
#Info on customers dataset
customers.shape

(206209, 10)

In [6]:
customers.describe()

             user_id            Age   n_dependants         income
count  206209.000000  206209.000000  206209.000000  206209.000000
mean   103105.000000      49.501646       1.499823   94632.852548
std     59527.555167      18.480962       1.118433   42473.786988
min         1.000000      18.000000       0.000000   25903.000000
25%     51553.000000      33.000000       0.000000   59874.000000
50%    103105.000000      49.000000       1.000000   93547.000000
75%    154657.000000      66.000000       3.000000  124244.000000
max    206209.000000      81.000000       3.000000  593901.000000

In [7]:
customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [8]:
#change name of column 'n_dependants' to 'number_of_dependants'
customers.rename(columns={'n_dependants':'number_of_dependants'}, inplace = True)

In [9]:
#change name of column 'surnam' to 'surname'
customers.rename(columns={'Surnam':'surname'}, inplace = True)

In [10]:
#change name of column 'First Name' to 'first_name'
customers.rename(columns={'First Name':'first_name'}, inplace = True)

In [11]:
#change name of column Gender to gender
customers.rename(columns={'Gender':'gender'}, inplace = True)

In [12]:
#change name of column STATE to state
customers.rename(columns={'STATE':'state'}, inplace = True)

In [13]:
#change name of column Age to age
customers.rename(columns={'Age':'age'}, inplace = True)

In [14]:
customers.head()

,user_id,first_name,surname,gender,state,age,date_joined,number_of_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [15]:
#Check data type of columns
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column                Non-Null Count   Dtype
---  ------                --------------   -----
 0   user_id               206209 non-null  int64
 1   first_name            194950 non-null  object
 2   surname               206209 non-null  object
 3   gender                206209 non-null  object
 4   state                 206209 non-null  object
 5   age                   206209 non-null  int64
 6   date_joined           206209 non-null  object
 7   number_of_dependants  206209 non-null  int64
 8   fam_status            206209 non-null  object
 9   income                206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

In [16]:
#Change user_id data type to string
customers['user_id']=customers['user_id'].astype('str')

In [17]:
customers.describe()

                 age  number_of_dependants         income
count  206209.000000         206209.000000  206209.000000
mean       49.501646              1.499823   94632.852548
std        18.480962              1.118433   42473.786988
min        18.000000              0.000000   25903.000000
25%        33.000000              0.000000   59874.000000
50%        49.000000              1.000000   93547.000000
75%        66.000000              3.000000  124244.000000
max        81.000000              3.000000  593901.000000

### 3. (step 5) Data Quality and Consistency Checks

In [18]:
#Check for mixed types
for col in customers.columns.tolist():
    weird=(customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis=1)
    if len(customers[weird])>0:
        print(col)

first_name

C:\Users\Marlo\AppData\Local\Temp\ipykernel_17604\2534410602.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird=(customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis=1)
C:\Users\Marlo\AppData\Local\Temp\ipykernel_17604\2534410602.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird=(customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis=1)
C:\Users\Marlo\AppData\Local\Temp\ipykernel_17604\2534410602.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird=(customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis=1)
C:\Users\Marlo\AppData\Local\Temp\ipykernel_17604\2534410602.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird=(customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis=1)
C:\Users\Marlo\AppData\Local\Temp\ipykernel_17604\2534410602.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird=(customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis=1)
C:\Users\Marlo\AppData\Local\Temp\ipykernel_17604\2534410602.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird=(customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis=1)
C:\Users\Marlo\AppData\Local\Temp\ipykernel_17604\2534410602.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird=(customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis=1)
C:\Users\Marlo\AppData\Local\Temp\ipykernel_17604\2534410602.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird=(customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis=1)
C:\Users\Marlo\AppData\Local\Temp\ipykernel_17604\2534410602.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird=(customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis=1)
C:\Users\Marlo\AppData\Local\Temp\ipykernel_17604\2534410602.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird=(customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis=1)

In [20]:
#Change 'First Name' Column so that it is not mixed type. 
customers['first_name']=customers['first_name'].astype('str')

In [21]:
#Check for mixed types
for col in customers.columns.tolist():
    weird=(customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis=1)
    if len(customers[weird])>0:
        print(col)

C:\Users\Marlo\AppData\Local\Temp\ipykernel_17604\2534410602.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird=(customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis=1)
C:\Users\Marlo\AppData\Local\Temp\ipykernel_17604\2534410602.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird=(customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis=1)
C:\Users\Marlo\AppData\Local\Temp\ipykernel_17604\2534410602.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird=(customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis=1)
C:\Users\Marlo\AppData\Local\Temp\ipykernel_17604\2534410602.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird=(customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis=1)
C:\Users\Marlo\AppData\Local\Temp\ipykernel_17604\2534410602.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird=(customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis=1)
C:\Users\Marlo\AppData\Local\Temp\ipykernel_17604\2534410602.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird=(customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis=1)
C:\Users\Marlo\AppData\Local\Temp\ipykernel_17604\2534410602.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird=(customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis=1)
C:\Users\Marlo\AppData\Local\Temp\ipykernel_17604\2534410602.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird=(customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis=1)
C:\Users\Marlo\AppData\Local\Temp\ipykernel_17604\2534410602.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird=(customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis=1)
C:\Users\Marlo\AppData\Local\Temp\ipykernel_17604\2534410602.py:3: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  weird=(customers[[col]].applymap(type) != customers[[col]].iloc[0].apply(type)).any(axis=1)

In [22]:
#Missing Values
customers.isnull().sum()

user_id                 0
first_name              0
surname                 0
gender                  0
state                   0
age                     0
date_joined             0
number_of_dependants    0
fam_status              0
income                  0
dtype: int64

There are no missing values.

In [23]:
#make new customers_dups to show 'customers' duplicates
customers_dups = customers[customers.duplicated()]

In [24]:
#show duplicates in 'customers' dataset
customers_dups

Empty DataFrame
Columns: [user_id, first_name, surname, gender, state, age, date_joined, number_of_dependants, fam_status, income]
Index: []

There are no duplicates in the dataset 'customers'.

### 4. (step 6) Combine Customer Data with Rest of Data

In [25]:
customers.head()

,user_id,first_name,surname,gender,state,age,date_joined,number_of_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [26]:
customers.shape

(206209, 10)

In [27]:
ords_prods_merge.shape

(32404859, 20)

In [28]:
#change dtype of user_id column in ords_prods_merge
ords_prods_merge['user_id'].dtype

dtype('int64')

In [29]:
ords_prods_merge['user_id']=ords_prods_merge['user_id'].astype('str')

In [30]:
ords_prods_merge.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32404859 entries, 0 to 32404858
Data columns (total 20 columns):
 #   Column                         Dtype
---  ------                         -----
 0   product_id                     int64
 1   product_name                   object
 2   aisle_id                       int64
 3   department_id                  int64
 4   prices                         float64
 5   order_id                       int64
 6   user_id                        object
 7   order_number                   int64
 8   orders_day_of_week             int64
 9   order_hour_of_day              int64
 10  days_since_prior_order         float64
 11  add_to_cart_order              int64
 12  reordered                      int64
 13  _merge                         category
 14  max_order                      int64
 15  loyalty_flag                   object
 16  mean_prices                    float64
 17  spending_flag                  object
 18  median_days_since_prior_order  float64
 19  frequency_flag                 object
dtypes: category(1), float64(4), int64(10), object(5)
memory usage: 4.6+ GB

In [31]:
#merge ords_prods_merge and customers on user_id 
ords_prods_cust_merge = ords_prods_merge.merge(customers, on = ['user_id'])

In [32]:
ords_prods_cust_merge.shape

(32404859, 29)

In [33]:
ords_prods_cust_merge.head()

,product_id,product_name,aisle_id,department_id,prices,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,...,frequency_flag,first_name,surname,gender,state,age,date_joined,number_of_dependants,fam_status,income
0,1,Chocolate Sandwich Cookies,61,19,5.8,3139998,138,28,6,11,...,frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
1,1,Chocolate Sandwich Cookies,61,19,5.8,1977647,138,30,6,17,...,frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
2,907,Premium Sliced Bacon,106,12,20.0,3160996,138,1,5,13,...,frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
3,907,Premium Sliced Bacon,106,12,20.0,2254091,138,10,5,14,...,frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
4,1000,Apricots,18,10,12.9,505689,138,9,6,12,...,frequent customer,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620

### 5. (step 8) Export dataframe

In [34]:
ords_prods_cust_merge.to_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'ords_prods_cust.pkl'))